AUTO_config_TK_pesok/src/DataProcessors/ТК_ЗагрузкаИзменений_Global_Center/ТК_ЗагрузкаИзменений_Global_Center.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ТК_ЗагрузкаИзменений_Global_Center</name>
</mdclass:DataProcessor>

AUTO_config_TK_pesok/src/InformationRegisters/РезультатыВыполненияОбработок/РезультатыВыполненияОбработок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РезультатыВыполненияОбработок</name>
  <resources>
    <name>Успешный</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>СообщенияОбОшибках</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторОбработки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючОбработки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

AUTO_config_TK_pesok/src/DataProcessors/ТК_ЗагрузкаИзменений_Global_Center/ObjectModule.bsl
Функция МассивДокументовЗагрузки()
	
	МассивДок = Новый Массив;
	МассивДок.Добавить("арт_ГрафикЗаказов");
	МассивДок.Добавить("арт_УстановкаГраницОстаткаНоменклатуры");
	МассивДок.Добавить("ПротоколСогласованияЦен");
	МассивДок.Добавить("ИзменениеЦен");
	МассивДок.Добавить("ИзменениеАссортиментаПодразделения");
	МассивДок.Добавить("ЗаказПоставщику");
	МассивДок.Добавить("ПоступлениеТоваров");
	МассивДок.Добавить("ВозвратПоставщику");
	МассивДок.Добавить("ПеремещениеТоваров");
	МассивДок.Добавить("ПересортицаТоваров");
	//МассивДок.Добавить("ВыпускПродукции");	
	МассивДок.Добавить("РеализацияТоваров");
	МассивДок.Добавить("ВозвратОтПокупателя");
	МассивДок.Добавить("СписаниеТоваров");
	МассивДок.Добавить("Инвентаризация");
	МассивДок.Добавить("ЗакрытиеСмены");
	МассивДок.Добавить("КорректировкаДолга");
	МассивДок.Добавить("ВыпискаПоПодразделению");
	МассивДок.Добавить("ПриходныйКассовыйОрдер");
	МассивДок.Добавить("РасходныйКассовыйОрдер");

	
	Возврат МассивДок;	
	
КонецФункции


Функция МассивСправочниковЗагрузки()
	
	МассивДок = Новый Массив;
	МассивДок.Добавить("Организации");
	МассивДок.Добавить("ТорговыеПлощадки");
	МассивДок.Добавить("СкладыКомпании");
	МассивДок.Добавить("Банки");
	МассивДок.Добавить("БанковскиеСчета");
	МассивДок.Добавить("Валюты");
	МассивДок.Добавить("ВидыАссортимента");
	МассивДок.Добавить("Контрагенты");
	МассивДок.Добавить("ДоговорыВзаиморасчетов");
	
	МассивДок.Добавить("ТоварныеМарки");
	МассивДок.Добавить("КлассификаторЕдиницИзмерения");
	МассивДок.Добавить("СтавкиНДС");
	МассивДок.Добавить("ТипыНоменклатуры");
	МассивДок.Добавить("НоменклатурныеГруппы");

	МассивДок.Добавить("Номенклатура");
	МассивДок.Добавить("ЕдиницыИзмерения");
	МассивДок.Добавить("ХарактеристикиНоменклатуры");
	
	МассивДок.Добавить("ТочкиДоставки");
	МассивДок.Добавить("ТипыЦен");
	МассивДок.Добавить("КассыККМ");
	МассивДок.Добавить("СтатьиДДС");
	МассивДок.Добавить("КассыКомпании");
	МассивДок.Добавить("КлассификаторПродаж");
	МассивДок.Добавить("ТипыПлатежныхКарт");
	
	//МассивДок.Добавить("Сотрудники");
	МассивДок.Добавить("ПрофилиКассиров");
	МассивДок.Добавить("Карточки");
	МассивДок.Добавить("ТипыБонусов");
	МассивДок.Добавить("КлассификаторУКТВЭД");
	
	МассивДок.Добавить("ХранилищеДополнительнойИнформации");

	Возврат МассивДок;	
	
КонецФункции



Процедура ЗагрузитьДанные(КлючОбработки,ОбъектыНаЗагрузку = Неопределено) Экспорт 
	
	ИдентификаторОбработки = "ТК_ЗагрузкаИзменений_Global_Center";		
	
	
	Попытка
		
		Определение = Новый WSОпределения("https://orders-1c.digma.ua/work_global_center/ws/xml-exchenge.1cws?wsdl","ObmenSSL","bynthghbpf",,,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено));	
		WS = Новый WSПрокси(Определение,"http://www.digma.ua/xml-exchenge", "ОбменПоПравилам", "ОбменПоПравиламSoap",,,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено));
		WS.Пароль ="bynthghbpf";
		WS.Пользователь="ObmenSSL";
		Правило = ПолучитьМакет("Правило").ПолучитьТекст();
		ХранилищеДанных = Новый ХранилищеЗначения(Правило, Новый СжатиеДанных(9));	
		

	Исключение 
		ОшибкиИнициализации = ОписаниеОшибки();
		
		СтруктруаЗаписиРезультатаВыполнения = РегистрыСведений.РезультатыВыполненияОбработок.СформироватьСтруктуруЗаписиРезультатов();
		СтруктруаЗаписиРезультатаВыполнения.ИдентификаторОбработки = ИдентификаторОбработки;
		СтруктруаЗаписиРезультатаВыполнения.КлючОбработки = КлючОбработки;
		
		КодСостояния = 	"ОбработкаОбмена.ИнициализацияОбработки - Ошибка инициализации";						
		РегистрыСведений.РезультатыВыполненияОбработок.СообщитьОбОшибке("КодСостояния "+КодСостояния, СтруктруаЗаписиРезультатаВыполнения);
		РегистрыСведений.РезультатыВыполненияОбработок.СообщитьОбОшибке("Описание "+ОшибкиИнициализации, СтруктруаЗаписиРезультатаВыполнения);												
		РегистрыСведений.РезультатыВыполненияОбработок.ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтруктруаЗаписиРезультатаВыполнения, Ложь);
		
		Возврат;
		
	КонецПопытки;
	
	
	Если ОбъектыНаЗагрузку = Неопределено  Тогда
		
		Если КлючОбработки ="ЗагрузкаСправочники_Global_Center" Тогда
			ОбъектыНаЗагрузку = МассивСправочниковЗагрузки();
		Иначе
			ОбъектыНаЗагрузку = МассивДокументовЗагрузки();
		КонецЕсли;
		
	КонецЕсли;
	
	
	
	ВсеОК = Истина;	
	Description = "";
	
	СтруктруаЗаписиРезультатаВыполнения = РегистрыСведений.РезультатыВыполненияОбработок.СформироватьСтруктуруЗаписиРезультатов();
	СтруктруаЗаписиРезультатаВыполнения.ИдентификаторОбработки = ИдентификаторОбработки;
	СтруктруаЗаписиРезультатаВыполнения.КлючОбработки = КлючОбработки;

	
	Для Каждого ОбЗагрузка Из ОбъектыНаЗагрузку Цикл 
		
		//УдалитьрегистрациюПередВыгрузкой = Ложь;
		ПараметрПродолжитьЗагрузку = Ложь;
		
		
		
		
		ЗначенияПараметров = Новый Структура("КодУзла,УдалитьрегистрациюПередВыгрузкой, ТипОбмена, ДокументВыгрузки", "SSL", ПараметрПродолжитьЗагрузку, КлючОбработки, ОбЗагрузка);
		ЗначенияПараметровXDTO = СериализаторXDTO.ЗаписатьXDTO(ЗначенияПараметров);
		
		Если  КлючОбработки = "ЗагрузкаДокументы_Global_Center" Тогда
			резРег = WS.RegDoc("ДокументыTK_SSL");
			Если Не резРег Тогда
				РегистрыСведений.РезультатыВыполненияОбработок.СообщитьОбОшибке("Ошибка регистрации", СтруктруаЗаписиРезультатаВыполнения);	
				Прервать;
			КонецЕсли;
			
		КонецЕсли;
		
		
		
		ДанныеЗагрузки = WS.ОтдатьДанные(ХранилищеДанных, ЗначенияПараметровXDTO, ПараметрПродолжитьЗагрузку,Истина);					
		Рез = ТК_ОбменДаннымиСервер.ВыполнитьЗагрузкуЧерезУниверсальныйОбменXML(ОбЗагрузка,ИдентификаторОбработки,ДанныеЗагрузки);
		
		ВсеОК = Рез.Success;
		
		Если  КлючОбработки = "ЗагрузкаДокументы_Global_Center" И ВсеОК Тогда
			Если ВсеОК Тогда
				резДел = WS.DelRegDoc("ДокументыTK_SSL");
				Если Не резДел Тогда
					РегистрыСведений.РезультатыВыполненияОбработок.СообщитьОбОшибке("Ошибка удаление регистрации", СтруктруаЗаписиРезультатаВыполнения);	
					Прервать;
				КонецЕсли;
			Иначе
				резРег = WS.RegDoc("ДокументыTK_SSL");
				Если Не резРег Тогда
					РегистрыСведений.РезультатыВыполненияОбработок.СообщитьОбОшибке("Ошибка регистрации", СтруктруаЗаписиРезультатаВыполнения);	
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;


		
		ПродолжитьЗагрузку = (Рез.Success И ПараметрПродолжитьЗагрузку) И Рез.Загружено > 0;

		
		
		Пока ПродолжитьЗагрузку Цикл 
			
			
			
			СтруктруаЗаписиРезультатаВыполнения = РегистрыСведений.РезультатыВыполненияОбработок.СформироватьСтруктуруЗаписиРезультатов();
			СтруктруаЗаписиРезультатаВыполнения.ИдентификаторОбработки = ИдентификаторОбработки;
			СтруктруаЗаписиРезультатаВыполнения.КлючОбработки = КлючОбработки;
			
			ЗначенияПараметров = Новый Структура("КодУзла,УдалитьрегистрациюПередВыгрузкой, ТипОбмена, ДокументВыгрузки", "SSL", ПродолжитьЗагрузку, КлючОбработки, ОбЗагрузка);
			ЗначенияПараметровXDTO = СериализаторXDTO.ЗаписатьXDTO(ЗначенияПараметров);

			
			
			
			ДанныеЗагрузки = WS.ОтдатьДанные(ХранилищеДанных, ЗначенияПараметровXDTO, ПродолжитьЗагрузку,Истина);					
			Рез = ТК_ОбменДаннымиСервер.ВыполнитьЗагрузкуЧерезУниверсальныйОбменXML(ОбЗагрузка,ИдентификаторОбработки,ДанныеЗагрузки);
			
			ВсеОК = Рез.Success;
			
			Если  КлючОбработки = "ЗагрузкаДокументы_Global_Center" И ВсеОК Тогда
				Если ВсеОК Тогда
					резДел = WS.DelRegDoc("ДокументыTK_SSL");
					Если Не резДел Тогда
						РегистрыСведений.РезультатыВыполненияОбработок.СообщитьОбОшибке("Ошибка удаление регистрации", СтруктруаЗаписиРезультатаВыполнения);	
						Прервать;
					КонецЕсли;
				Иначе
					резРег = WS.RegDoc("ДокументыTK_SSL");
					Если Не резРег Тогда
						РегистрыСведений.РезультатыВыполненияОбработок.СообщитьОбОшибке("Ошибка регистрации", СтруктруаЗаписиРезультатаВыполнения);	
						Прервать;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			ПродолжитьЗагрузку = (Рез.Success И ПродолжитьЗагрузку) И Рез.Загружено > 0;
			
			Если ВсеОк = Ложь Тогда
				Description = Description + Рез.Description +Символы.ПС;
			КонецЕсли;
			
		КонецЦикла;
		
		Если НЕ ВсеОК Тогда
			РегистрыСведений.РезультатыВыполненияОбработок.СообщитьОбОшибке("Описание "+Description, СтруктруаЗаписиРезультатаВыполнения);	
			Прервать;
		КонецЕсли;
		
		
	КонецЦикла;
	
	
	
	 РегистрыСведений.РезультатыВыполненияОбработок.ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтруктруаЗаписиРезультатаВыполнения, ВсеОк);
		
	
КонецПроцедуры
